garden-planner/app/controllers/plants_controller.rb

SELECT  "gardens".* FROM "gardens"  ORDER BY "gardens"."id" ASC LIMIT 1
---
  def index
    @rowLenth = 6
    @potSet= 0
    @gardens = Garden.all

SELECT "plants".* FROM "plants"
---


    if @sort_by
      @plants = Plant.order(@sort_by)